#include<stdio.h>
#include<stdlib.h>
/*
	這是一題滿複雜的邏輯題目，首先要注意它的XY座標是相反的 ，再來就是要理解題目要表達的東西。 

	(y,x)依序為:(0,0)=0 - (1,0)=1 - (0,1)=2 - (2,0)=3 - (1,1)=4 - (0,2)=5 ...以此類推(可以想成與(0,0)的距離)
	諾我要計算(y,x)(0,0)到(y,x)(0,2)的距離的話就是5-0=5;
			  (y,x)(1,0)到(y,x)(1,1)的距離的話就是4-1=3;
	現在知道題目要問甚麼了再來就是觀察要怎麼計算(y,x)=?
	可以發現(1,0)=1;(2,0)=3;(3,0)=6;(4,0)=10 通識為(1+0.5(y-1))y，但會發現(1,0)下一個是跳到(0,1)，這裡的y又變回0了，
	為了不要計算錯誤將原本的y設為"y+x"這樣同一階層自然通識會一樣了，並且最後再加上"x"，所以最後的通識為:(y+x)*(1+0.5*(y+x-1))+x;	 
*/ 
int main()
{
	int x1,y1,f1;
	int x2,y2,f2;
	int ans;
	int i=1;
	int times;
	scanf("%d",&times);
	while(times--)
	{
		scanf("%d%d%d%d",&x1,&y1,&x2,&y2);
		f1 = 0,f2 = 0;
		f1 = (y1+x1)*(1+0.5*(y1+x1-1))+x1;
		f2 = (y2+x2)*(1+0.5*(y2+x2-1))+x2;
		ans = 0;
		ans = f2 - f1;
		printf("case %d: %d\n",i++,ans);
	}	
 } 
